<a href="https://colab.research.google.com/github/smart4ghari/Data_Science/blob/main/3_1_Pandas_practice.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
# Import pandas
import pandas as pd

In [ ]:
survey = pd.read_csv("annual-enterprise-survey-2021-financial-year-provisional-csv.csv")

In [ ]:
survey

,Year,Industry_aggregation_NZSIOC,Industry_code_NZSIOC,Industry_name_NZSIOC,Units,Variable_code,Variable_name,Variable_category,Value,Industry_code_ANZSIC06
0,2021,Level 1,99999,All industries,Dollars (millions),H01,Total income,Financial performance,"757,504",ANZSIC06 divisions A-S (excluding classes K633...
1,2021,Level 1,99999,All industries,Dollars (millions),H04,"Sales, government funding, grants and subsidies",Financial performance,"674,890",ANZSIC06 divisions A-S (excluding classes K633...
2,2021,Level 1,99999,All industries,Dollars (millions),H05,"Interest, dividends and donations",Financial performance,"49,593",ANZSIC06 divisions A-S (excluding classes K633...
3,2021,Level 1,99999,All industries,Dollars (millions),H07,Non-operating income,Financial performance,"33,020",ANZSIC06 divisions A-S (excluding classes K633...
4,2021,Level 1,99999,All industries,Dollars (millions),H08,Total expenditure,Financial performance,"654,404",ANZSIC06 divisions A-S (excluding classes K633...
...,...,...,...,...,...,...,...,...,...,...
41710,2013,Level 3,ZZ11,Food product manufacturing,Percentage,H37,Quick ratio,Financial ratios,52,"ANZSIC06 groups C111, C112, C113, C114, C115, ..."
41711,2013,Level 3,ZZ11,Food product manufacturing,Percentage,H38,Margin on sales of goods for resale,Financial ratios,40,"ANZSIC06 groups C111, C112, C113, C114, C115, ..."
41712,2013,Level 3,ZZ11,Food product manufacturing,Percentage,H39,Return on equity,Financial ratios,12,"ANZSIC06 groups C111, C112, C113, C114, C115, ..."
41713,2013,Level 3,ZZ11,Food product manufacturing,Percentage,H40,Return on total assets,Financial ratios,5,"ANZSIC06 groups C111, C112, C113, C114, C115, ..."
41714,2013,Level 3,ZZ11,Food product manufacturing,Percentage,H41,Liabilities structure,Financial ratios,46,"ANZSIC06 groups C111, C112, C113, C114, C115, ..."

In [ ]:
survey.head() # Print first 5 data

,Year,Industry_aggregation_NZSIOC,Industry_code_NZSIOC,Industry_name_NZSIOC,Units,Variable_code,Variable_name,Variable_category,Value,Industry_code_ANZSIC06
0,2021,Level 1,99999,All industries,Dollars (millions),H01,Total income,Financial performance,"757,504",ANZSIC06 divisions A-S (excluding classes K633...
1,2021,Level 1,99999,All industries,Dollars (millions),H04,"Sales, government funding, grants and subsidies",Financial performance,"674,890",ANZSIC06 divisions A-S (excluding classes K633...
2,2021,Level 1,99999,All industries,Dollars (millions),H05,"Interest, dividends and donations",Financial performance,"49,593",ANZSIC06 divisions A-S (excluding classes K633...
3,2021,Level 1,99999,All industries,Dollars (millions),H07,Non-operating income,Financial performance,"33,020",ANZSIC06 divisions A-S (excluding classes K633...
4,2021,Level 1,99999,All industries,Dollars (millions),H08,Total expenditure,Financial performance,"654,404",ANZSIC06 divisions A-S (excluding classes K633...

In [ ]:
type(survey)

pandas.core.frame.DataFrame

In [ ]:
# Getting the details of the columns
survey.columns

Index(['Year', 'Industry_aggregation_NZSIOC', 'Industry_code_NZSIOC',
       'Industry_name_NZSIOC', 'Units', 'Variable_code', 'Variable_name',
       'Variable_category', 'Value', 'Industry_code_ANZSIC06'],
      dtype='object')

In [ ]:
# Getting the datatypes of dataset
get_dtype = survey.dtypes
get_dtype

Year                            int64
Industry_aggregation_NZSIOC    object
Industry_code_NZSIOC           object
Industry_name_NZSIOC           object
Units                          object
Variable_code                  object
Variable_name                  object
Variable_category              object
Value                          object
Industry_code_ANZSIC06         object
dtype: object

In [ ]:
type(get_dtype)
# Here the datatype would be panda series (It's somewhat similar to python list but not same as python list)

pandas.core.series.Series

In [ ]:
get_dtype['Variable_code']

dtype('O')

In [ ]:
# getting the values based on index
get_dtype[0:]

Year                            int64
Industry_aggregation_NZSIOC    object
Industry_code_NZSIOC           object
Industry_name_NZSIOC           object
Units                          object
Variable_code                  object
Variable_name                  object
Variable_category              object
Value                          object
Industry_code_ANZSIC06         object
dtype: object

In [ ]:
get_dtype[7]

dtype('O')

In [ ]:
survey['Variable_code']

0        H01
1        H04
2        H05
3        H07
4        H08
        ...
41710    H37
41711    H38
41712    H39
41713    H40
41714    H41
Name: Variable_code, Length: 41715, dtype: object

In [ ]:
# Get the data from 5th index to 100th index for variable_code column
survey['Variable_code'][5:101]

5      H09
6      H10
7      H11
8      H12
9      H13
      ...
96     H08
97     H09
98     H10
99     H11
100    H12
Name: Variable_code, Length: 96, dtype: object

In [ ]:
# print the data in reverse direction
survey['Variable_code'][101:5:-1]

101    H13
100    H12
99     H11
98     H10
97     H09
      ...
10     H14
9      H13
8      H12
7      H11
6      H10
Name: Variable_code, Length: 96, dtype: object

In [ ]:
# Negative index doesn't exist for series
survey['Variable_code'][-1]

KeyError: -1

In [ ]:
survey['Variable_code'][::-1]

41714    H41
41713    H40
41712    H39
41711    H38
41710    H37
        ...
4        H08
3        H07
2        H05
1        H04
0        H01
Name: Variable_code, Length: 41715, dtype: object

In [ ]:
# Getting the basic statistics of the data using describe method (It'll give output for col which contains int or float)
survey.describe()

              Year
count  41715.00000
mean    2017.00000
std        2.58202
min     2013.00000
25%     2015.00000
50%     2017.00000
75%     2019.00000
max     2021.00000

In [ ]:
# Filtering all entries only with object datatype
filtered = survey[survey.dtypes[survey.dtypes == 'object'].index]

In [ ]:
filtered

,Industry_aggregation_NZSIOC,Industry_code_NZSIOC,Industry_name_NZSIOC,Units,Variable_code,Variable_name,Variable_category,Value,Industry_code_ANZSIC06
0,Level 1,99999,All industries,Dollars (millions),H01,Total income,Financial performance,"757,504",ANZSIC06 divisions A-S (excluding classes K633...
1,Level 1,99999,All industries,Dollars (millions),H04,"Sales, government funding, grants and subsidies",Financial performance,"674,890",ANZSIC06 divisions A-S (excluding classes K633...
2,Level 1,99999,All industries,Dollars (millions),H05,"Interest, dividends and donations",Financial performance,"49,593",ANZSIC06 divisions A-S (excluding classes K633...
3,Level 1,99999,All industries,Dollars (millions),H07,Non-operating income,Financial performance,"33,020",ANZSIC06 divisions A-S (excluding classes K633...
4,Level 1,99999,All industries,Dollars (millions),H08,Total expenditure,Financial performance,"654,404",ANZSIC06 divisions A-S (excluding classes K633...
...,...,...,...,...,...,...,...,...,...
41710,Level 3,ZZ11,Food product manufacturing,Percentage,H37,Quick ratio,Financial ratios,52,"ANZSIC06 groups C111, C112, C113, C114, C115, ..."
41711,Level 3,ZZ11,Food product manufacturing,Percentage,H38,Margin on sales of goods for resale,Financial ratios,40,"ANZSIC06 groups C111, C112, C113, C114, C115, ..."
41712,Level 3,ZZ11,Food product manufacturing,Percentage,H39,Return on equity,Financial ratios,12,"ANZSIC06 groups C111, C112, C113, C114, C115, ..."
41713,Level 3,ZZ11,Food product manufacturing,Percentage,H40,Return on total assets,Financial ratios,5,"ANZSIC06 groups C111, C112, C113, C114, C115, ..."
41714,Level 3,ZZ11,Food product manufacturing,Percentage,H41,Liabilities structure,Financial ratios,46,"ANZSIC06 groups C111, C112, C113, C114, C115, ..."

In [ ]:
filtered.describe()

,Industry_aggregation_NZSIOC,Industry_code_NZSIOC,Industry_name_NZSIOC,Units,Variable_code,Variable_name,Variable_category,Value,Industry_code_ANZSIC06
count,41715,41715,41715,41715,41715,41715,41715,41715,41715
unique,3,139,119,3,39,41,3,10084,121
top,Level 4,GH12,"Public Order, Safety and Regulatory Services",Dollars (millions),H01,Total income,Financial performance,C,ANZSIC06 group C170
freq,22833,324,775,32796,1251,1251,20853,1909,648

In [ ]:
    survey['Industry_aggregation_NZSIOC'] # Getting single column

0        Level 1
1        Level 1
2        Level 1
3        Level 1
4        Level 1
          ...
41710    Level 3
41711    Level 3
41712    Level 3
41713    Level 3
41714    Level 3
Name: Industry_aggregation_NZSIOC, Length: 41715, dtype: object

In [ ]:
# Getting multiple columns
survey[['Industry_aggregation_NZSIOC','Variable_code']]

      Industry_aggregation_NZSIOC Variable_code
0                         Level 1           H01
1                         Level 1           H04
2                         Level 1           H05
3                         Level 1           H07
4                         Level 1           H08
...                           ...           ...
41710                     Level 3           H37
41711                     Level 3           H38
41712                     Level 3           H39
41713                     Level 3           H40
41714                     Level 3           H41

[41715 rows x 2 columns]

In [ ]:
import numpy as np

In [ ]:
np.where(survey['Variable_name' and 'Variable_code'].isnull() == True)

(array([], dtype=int64),)

In [ ]:
# survey.iloc[np.where(survey[(survey.Variable_name == 'Total income') & (survey.Variable_code == 'H01')])]

survey[(survey['Variable_name'] == 'Total income') & (survey['Variable_code'] == 'H01')]['Year']

0        2021
31       2021
62       2021
92       2021
122      2021
         ...
41551    2013
41583    2013
41615    2013
41647    2013
41679    2013
Name: Year, Length: 1251, dtype: int64

In [ ]:
# iloc method (gives index details)
survey.iloc[[1,4,2,1000]]

,Year,Industry_aggregation_NZSIOC,Industry_code_NZSIOC,Industry_name_NZSIOC,Units,Variable_code,Variable_name,Variable_category,Value,Industry_code_ANZSIC06
1,2021,Level 1,99999,All industries,Dollars (millions),H04,"Sales, government funding, grants and subsidies",Financial performance,"674,890",ANZSIC06 divisions A-S (excluding classes K633...
4,2021,Level 1,99999,All industries,Dollars (millions),H08,Total expenditure,Financial performance,"654,404",ANZSIC06 divisions A-S (excluding classes K633...
2,2021,Level 1,99999,All industries,Dollars (millions),H05,"Interest, dividends and donations",Financial performance,"49,593",ANZSIC06 divisions A-S (excluding classes K633...
1000,2021,Level 4,CC521,Basic Chemical and Basic Polymer Manufacturing,Dollars (millions),H05,"Interest, dividends and donations",Financial performance,C,ANZSIC06 groups C181 and C182

In [ ]:
# Adding a new column to the survey dataset
survey['New_col'] = 'Hari'

In [ ]:
survey.head()

,Year,Industry_aggregation_NZSIOC,Industry_code_NZSIOC,Industry_name_NZSIOC,Units,Variable_code,Variable_name,Variable_category,Value,Industry_code_ANZSIC06,New_col
0,2021,Level 1,99999,All industries,Dollars (millions),H01,Total income,Financial performance,"757,504",ANZSIC06 divisions A-S (excluding classes K633...,Hari
1,2021,Level 1,99999,All industries,Dollars (millions),H04,"Sales, government funding, grants and subsidies",Financial performance,"674,890",ANZSIC06 divisions A-S (excluding classes K633...,Hari
2,2021,Level 1,99999,All industries,Dollars (millions),H05,"Interest, dividends and donations",Financial performance,"49,593",ANZSIC06 divisions A-S (excluding classes K633...,Hari
3,2021,Level 1,99999,All industries,Dollars (millions),H07,Non-operating income,Financial performance,"33,020",ANZSIC06 divisions A-S (excluding classes K633...,Hari
4,2021,Level 1,99999,All industries,Dollars (millions),H08,Total expenditure,Financial performance,"654,404",ANZSIC06 divisions A-S (excluding classes K633...,Hari

In [ ]:
# Converting list to series
l = [1,2,3,4,5]
cvt = pd.Series(l)
print(cvt)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [ ]:
# Converting dictionary into a dataframe
d = {'1':"Hari",'2':'Siva','3':'Raj','4':'Dinesh'}
cvt1 = pd.DataFrame(d, index = d.keys())
cvt1

      1     2    3       4
1  Hari  Siva  Raj  Dinesh
2  Hari  Siva  Raj  Dinesh
3  Hari  Siva  Raj  Dinesh
4  Hari  Siva  Raj  Dinesh

In [ ]:
# Creating a random dataframe using np.random method

df1 = pd.DataFrame(np.random.randint(1,10,(5,5)),index=['a','b','c','d','e'],columns=['x','y','z','z1','z2'])

In [ ]:
df1

   x  y  z  z1  z2
a  1  9  6   5   6
b  8  2  3   3   1
c  8  4  3   9   9
d  3  1  5   8   7
e  9  4  4   8   4

In [ ]:
df1.loc["c":"d","z":"z1"]

   z  z1
c  3   9
d  5   8

In [ ]:
# Creating a new column
df1['New'] = df1['x'] + df1['y']
df1

   x  y  z  z1  z2  New
a  1  9  6   5   6   10
b  8  2  3   3   1   10
c  8  4  3   9   9   12
d  3  1  5   8   7    4
e  9  4  4   8   4   13

In [ ]:
# Dropping a column
df1.drop('x',axis = 1)

   y  z  z1  z2  New
a  9  6   5   6   10
b  2  3   3   1   10
c  4  3   9   9   12
d  1  5   8   7    4
e  4  4   8   4   13

In [ ]:
# But when we see the output, it's not dropped (it's just temporary)
df1

   x  y  z  z1  z2  New
a  1  9  6   5   6   10
b  8  2  3   3   1   10
c  8  4  3   9   9   12
d  3  1  5   8   7    4
e  9  4  4   8   4   13

In [ ]:
# using the seed function to keep it as a constant
np.random.seed(23)
df2 = pd.DataFrame(np.random.randn(4,5),index=['a','b','c','d'],columns=['x','y','z','z1','z2'])

In [ ]:
df2

          x         y         z        z1        z2
a  0.666988  0.025813 -0.777619  0.948634  0.701672
b -1.051082 -0.367548 -1.137460 -1.322148  1.772258
c -0.347459  0.670140  0.322272  0.060343 -1.043450
d -1.009942  0.441736  1.128877 -1.838068 -0.938769

In [ ]:
# Get only the negative values from the above dataframe
df2.values[df2.values < 0]

array([-0.77761941, -1.05108156, -0.36754812, -1.13745969, -1.32214752,
       -0.34745899, -1.04345   , -1.00994188, -1.83806777, -0.93876863])

In [ ]:
# Getting the respective rows and column names
res = df2.values[df2.values < 0]
for rows in df2.index:
    for columns in df2.columns:
        if df2.loc[rows,columns] in res:
            print(rows,columns,df2.loc[rows,columns])

a z -0.7776194131918178
b x -1.0510815639071178
b y -0.3675481161171661
b z -1.1374596907250272
b z1 -1.3221475225908594
c x -0.34745899102186334
c z2 -1.0434500017467254
d x -1.0099418765878465
d z1 -1.8380677677579502
d z2 -0.9387686311201282

### Pandas series

In [ ]:
mydata = list(range(1,11))
myindex = ["Hari","Haran","Rocky","Jacky","Stuart","John","Kate","William","richard","Pluto"]
ser1 = pd.Series(mydata,myindex)
ser1

Hari        1
Haran       2
Rocky       3
Jacky       4
Stuart      5
John        6
Kate        7
William     8
richard     9
Pluto      10
dtype: int64

In [ ]:
# Accessing the data of Series using index (Normal python index)
ser1[0]

1

In [ ]:
# Accessing the data of Series using labelled index (Preferable)
ser1['Hari']

1

In the above statements both gives the same result

In [ ]:
# Giving the Series using dictionary
dict1 = {'Laptop':1,"Computer":2,"Keyboard":3,"Mobile":4}

### Smartness
Pandas series is smart enough to split dictionary into key and value pairs

In [ ]:
ser2 = pd.Series(dict1)
print(ser2)
print('\n')
print(ser2.keys())
print('\n')
print(ser2.values)

Laptop      1
Computer    2
Keyboard    3
Mobile      4
dtype: int64


Index(['Laptop', 'Computer', 'Keyboard', 'Mobile'], dtype='object')


[1 2 3 4]

In [ ]:
# Creating two dictionary
d1 = {"India":1,"Pakistan":2,"China":3,"Japan":4}
d2 = {"Brazil":5,"USA":6,"UK":7,"Sweden":8}

In [ ]:
sales_q1 = pd.Series(d1)
sales_q2 = pd.Series(d2)

In [ ]:
sales_q1

India       1
Pakistan    2
China       3
Japan       4
dtype: int64

In [ ]:
sales_q2

Brazil    5
USA       6
UK        7
Sweden    8
dtype: int64

In [ ]:
sales_q1.keys()

Index(['India', 'Pakistan', 'China', 'Japan'], dtype='object')

In [ ]:
sales_q1.values

array([1, 2, 3, 4], dtype=int64)

In [ ]:
# Arithmetic operations on pandas series
sales_q1 * 2

India       2
Pakistan    4
China       6
Japan       8
dtype: int64

In [ ]:
total_sales = sales_q1 + sales_q2
print(total_sales)

Brazil     NaN
China      NaN
India      NaN
Japan      NaN
Pakistan   NaN
Sweden     NaN
UK         NaN
USA        NaN
dtype: float64

In [ ]:
sales_q1.add(sales_q2,fill_value = 0)

Brazil      5.0
China       3.0
India       1.0
Japan       4.0
Pakistan    2.0
Sweden      8.0
UK          7.0
USA         6.0
dtype: float64

### Pandas DataFrame
- A DataFrame is a table of columns and rows in pandas that we can easily restructure and filter
- A group of pandas series objects that share the same index
- DataFrame is the main pandas object which is extremely useful

In [ ]:
# Creating a pandas DataFrame
np.random.seed(101)
mydata = np.random.randint(0,101,(4,3))

In [ ]:
mydata

array([[95, 11, 81],
       [70, 63, 87],
       [75,  9, 77],
       [40,  4, 63]])

In [ ]:
# Giving index values ( Which is nothing but row values )
myindex = ['CA','NY','AZ','TX']

# Giving column values
mycolumns = ['Jan','Feb','Mar']

In [ ]:
df2 = pd.DataFrame(mydata,myindex,mycolumns)
df2

    Jan  Feb  Mar
CA   95   11   81
NY   70   63   87
AZ   75    9   77
TX   40    4   63

In [ ]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, CA to TX
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Jan     4 non-null      int32
 1   Feb     4 non-null      int32
 2   Mar     4 non-null      int32
dtypes: int32(3)
memory usage: 252.0+ bytes

In [ ]:
pwd

'C:\\Users\\munee\\Music\\Data Science Naresh IT'

In [ ]:
ls

 Volume in drive C is Windows-SSD
 Volume Serial Number is D07F-236D

 Directory of C:\Users\munee\Music\Data Science Naresh IT

16-01-2024  15:26    <DIR>          .
06-01-2024  09:25    <DIR>          ..
16-01-2024  11:01    <DIR>          .ipynb_checkpoints
07-01-2024  11:04           102,666 1_Introduction.ipynb
07-01-2024  11:47             9,637 2_Type_Casting.ipynb
07-01-2024  20:23             3,460 3_basics.ipynb
14-01-2024  17:22            33,005 4.1_Numpy_Examples.ipynb
08-01-2024  12:52             8,609 4_Numpy_practice.ipynb
13-01-2024  15:34           955,618 5.1_Matplotlib_Examples.ipynb
13-01-2024  12:20           225,086 5_Matplotlib_Practice.ipynb
16-01-2024  15:26            93,821 6.1_Pandas_practice.ipynb
16-01-2024  11:00         6,617,174 annual-enterprise-survey-2021-financial-year-provisional-csv.csv
               9 File(s)      8,049,076 bytes
               3 Dir(s)  85,313,024,000 bytes free

In [ ]:
df3 = pd.read_csv("tips.csv")

In [ ]:
df3

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251
...,...,...,...,...,...,...,...,...,...,...,...
239,29.03,5.92,Male,No,Sat,Dinner,3,9.68,Michael Avila,5296068606052842,Sat2657
240,27.18,2.00,Female,Yes,Sat,Dinner,2,13.59,Monica Sanders,3506806155565404,Sat1766
241,22.67,2.00,Male,Yes,Sat,Dinner,2,11.34,Keith Wong,6011891618747196,Sat3880
242,17.82,1.75,Male,No,Sat,Dinner,2,8.91,Dennis Dixon,4375220550950,Sat17
243,18.78,3.00,Female,No,Thur,Dinner,2,9.39,Michelle Hardin,3511451626698139,Thur672

In [ ]:
df3.columns

Index(['total_bill', 'tip', 'sex', 'smoker', 'day', 'time', 'size',
       'price_per_person', 'Payer Name', 'CC Number', 'Payment ID'],
      dtype='object')

In [ ]:
df3.index

RangeIndex(start=0, stop=244, step=1)